app/controllers/yogurts_controller.rb

SELECT "yogurts".* FROM "yogurts"
---
  def index
    @yogurts = Yogurt.all

INSERT INTO "yogurts" ("created_at", "flavor", "quantity", "topping", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 04 Jun 2014 06:18:10 UTC +00:00], ["flavor", "peanutbutter"], ["quantity", 1.0], ["topping", "cherries"], ["updated_at", Wed, 04 Jun 2014 06:18:10 UTC +00:00]]
---
  def create
    @yogurt = Yogurt.new(yogurt_params)

    if @yogurt.save

DELETE FROM "yogurts" WHERE "yogurts"."id" = $1  [["id", 1]]
---
  def destroy

    @yogurt.destroy

SELECT "yogurts".* FROM "yogurts" WHERE "yogurts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def set_yogurt
    @yogurt = Yogurt.find(params[:id])